src/xml/util/post_templateFull.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <ns1:getObjectRequest>
      <ns1:identifier>PIDPLACE</ns1:identifier>
      <ns1:agency>100200</ns1:agency>
      <ns1:includeHoldingsCount>1</ns1:includeHoldingsCount>
      <ns1:profile>test</ns1:profile>
      <ns1:start>1</ns1:start>
      <ns1:stepValue>10</ns1:stepValue>
      <ns1:objectFormat>dkabm</ns1:objectFormat>
      <ns1:objectFormat>marcxchange</ns1:objectFormat>
      <ns1:relationData>full</ns1:relationData>
    </ns1:getObjectRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
